data/RANS/Re_tau_150_Pr_071/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2106                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          8;
        startFace       1596;
    }
    inlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       1604;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  outlet;
    }
    outlet
    {
        type            cyclic;
        inGroups        1(cyclic);
        nFaces          400;
        startFace       2004;
        matchTolerance  0.0001;
        transform       unknown;
        neighbourPatch  inlet;
    }
    sides
    {
        type            empty;
        inGroups        1(empty);
        nFaces          800;
        startFace       2404;
    }
)

// ************************************************************************* //
